app/controllers/tweets_controller.rb

    def index
        render json: {status: 200, tweet: Tweet.all}
---
SELECT "tweets".* FROM "tweets"

    def show
        tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

    def create
        tweet = Tweet.new(tweet_params)
        if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1, "content" = $2, "author" = $3, "updated_at" = $4 WHERE "tweets"."id" = $5  [["title", "wrong place wrong time"], ["content", "kickin ass taking names"], ["author", "willow"], ["updated_at", "2021-02-24 03:41:41.745828"], ["id", 11]]

    def destroy
        tweet = Tweet.find(params[:id])
        tweet.destroy()
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 11]]